# Import Pandas Library

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(
    [
        [1, np.nan, 3],
        [4,5,6],
        [np.nan, 8, 9],
        [np.nan, 11, 12]
    ],
    index = ['A', 'B', 'C', 'D'],
    columns = ['C1', 'C2', 'C3'])

In [3]:
df.head()

    C1    C2  C3
A  1.0   NaN   3
B  4.0   5.0   6
C  NaN   8.0   9
D  NaN  11.0  12

# Drop Null

In [4]:
df.dropna()

    C1   C2  C3
B  4.0  5.0   6

In [5]:
df.dropna(axis = 1)

   C3
A   3
B   6
C   9
D  12

In [6]:
df.dropna(axis = 1, thresh = 3)

     C2  C3
A   NaN   3
B   5.0   6
C   8.0   9
D  11.0  12

# Fill Null Cells

In [7]:
df.fillna('?')

    C1    C2  C3
A  1.0     ?   3
B  4.0   5.0   6
C    ?   8.0   9
D    ?  11.0  12

In [8]:
df.fillna(55)

     C1    C2  C3
A   1.0  55.0   3
B   4.0   5.0   6
C  55.0   8.0   9
D  55.0  11.0  12

# Bye